{
  "data": [
    ["Understanding Diabetes: Types and Symptoms", "Dr. John Doe", "2023-01-15", "Diabetes is a chronic condition characterized by high levels of sugar in the blood. This tutorial covers the different types of diabetes, including Type 1, Type 2, and gestational diabetes, and their respective symptoms. Understanding these can help in early detection and management of the condition.", "tutorial_1"],
    ["Healthy Eating for Diabetes Management", "Jane Smith", "2023-02-10", "Diet plays a crucial role in managing diabetes. This tutorial provides guidance on healthy eating habits, including portion control, balancing macronutrients, and choosing low-glycemic foods to help maintain stable blood sugar levels.", "tutorial_2"],
    ["Exercise Tips for Diabetics", "Michael Brown", "2023-03-05", "Regular physical activity is essential for managing diabetes. This tutorial offers exercise tips tailored for diabetics, including the benefits of different types of exercise, safety precautions, and how to get started with a fitness routine.", "tutorial_3"],
    ["Monitoring Blood Sugar Levels", "Dr. Emily Davis", "2023-04-20", "Monitoring blood sugar levels is a key aspect of diabetes management. This tutorial explains how to use a glucometer, the importance of regular monitoring, and how to interpret blood sugar readings to make informed decisions about diet and medication.", "tutorial_4"],
    ["Managing Stress for Better Diabetes Control", "Sarah Martinez", "2023-05-10", "Stress can significantly impact blood sugar levels. This tutorial explores the connection between stress and diabetes, and provides practical strategies for stress management, including relaxation techniques, mindfulness, and physical activity.", "tutorial_5"],
    ["Insulin Therapy: What You Need to Know", "Dr. Christopher Lee", "2023-06-15", "For many diabetics, insulin therapy is an essential part of treatment. This tutorial covers the basics of insulin therapy, including different types of insulin, how to administer insulin, and tips for managing insulin therapy effectively.", "tutorial_6"],
    ["Understanding Carbohydrate Counting", "Jessica Thompson", "2023-07-05", "Carbohydrate counting is a useful tool for managing blood sugar levels. This tutorial explains what carbohydrate counting is, how to calculate carbohydrate intake, and tips for integrating this method into daily meal planning.", "tutorial_7"],
    ["Foot Care for Diabetics", "Andrew White", "2023-08-10", "Diabetics need to take special care of their feet to prevent complications. This tutorial provides guidelines for proper foot care, including daily inspections, choosing the right footwear, and when to seek medical attention for foot problems.", "tutorial_8"],
    ["The Role of Fiber in Diabetes Management", "Laura Green", "2023-09-01", "Fiber plays an important role in managing diabetes by helping to control blood sugar levels and improve digestion. This tutorial discusses the benefits of fiber, sources of dietary fiber, and tips for increasing fiber intake in your diet.", "tutorial_9"],
    ["Understanding Hypoglycemia and Hyperglycemia", "Brian Harris", "2023-10-20", "Hypoglycemia and hyperglycemia are common concerns for diabetics. This tutorial explains the symptoms, causes, and treatments for both low and high blood sugar levels, and offers tips for preventing these conditions.", "tutorial_10"],
    ["The Benefits of Strength Training for Diabetics", "Linda Clark", "2023-11-15", "Strength training can be particularly beneficial for diabetics. This tutorial explores the advantages of incorporating strength training into a fitness routine, including improved insulin sensitivity and muscle mass, and offers tips for getting started.", "tutorial_11"],
    ["Diabetes and Heart Health", "Kevin Young", "2023-12-05", "Diabetics are at higher risk for heart disease. This tutorial highlights the connection between diabetes and heart health, and provides strategies for reducing cardiovascular risk through diet, exercise, and medication management.", "tutorial_12"],
    ["Managing Diabetes During Pregnancy", "Samantha Hill", "2024-01-10", "Pregnancy presents unique challenges for diabetic women. This tutorial offers guidance on managing diabetes during pregnancy, including monitoring blood sugar levels, adjusting medication, and following a healthy diet for the benefit of both mother and baby.", "tutorial_13"],
    ["The Importance of Regular Medical Checkups", "Richard King", "2024-02-20", "Regular medical checkups are crucial for managing diabetes and preventing complications. This tutorial explains the importance of routine healthcare visits, what to expect during checkups, and how to prepare for appointments to make the most of your healthcare.", "tutorial_14"],
    ["Hydration and Diabetes: What You Need to Know", "Patricia Scott", "2024-03-15", "Staying hydrated is essential for everyone, especially diabetics. This tutorial covers the importance of hydration, signs of dehydration, and tips for maintaining adequate fluid intake to support overall health and blood sugar control.", "tutorial_15"],
    ["Travel Tips for Diabetics", "Daniel Roberts", "2024-04-05", "Traveling with diabetes requires careful planning. This tutorial provides practical tips for traveling with diabetes, including packing essentials, managing blood sugar levels on the go, and handling emergencies while away from home.", "tutorial_16"],
    ["The Impact of Sleep on Diabetes Management", "Michael Walker", "2024-05-25", "Sleep plays a significant role in managing diabetes. This tutorial discusses the impact of sleep on blood sugar levels, strategies for improving sleep quality, and the importance of maintaining a regular sleep schedule for better diabetes control.", "tutorial_17"],
    ["Healthy Snacks for Diabetics", "Stephanie Collins", "2024-06-10", "Choosing healthy snacks is important for managing blood sugar levels. This tutorial offers ideas for diabetic-friendly snacks that are nutritious, delicious, and help keep blood sugar levels stable throughout the day.", "tutorial_18"],
    ["Understanding the Glycemic Index", "Robert Turner", "2024-07-15", "The glycemic index (GI) is a valuable tool for diabetics to understand how different foods affect blood sugar levels. This tutorial explains what the glycemic index is, how it works, and how to use it to make informed food choices.", "tutorial_19"],
    ["Dealing with Diabetes Burnout", "Emily Harris", "2024-08-05", "Managing diabetes can be overwhelming and lead to burnout. This tutorial provides strategies for coping with diabetes burnout, including seeking support, setting realistic goals, and finding motivation to continue with diabetes management.", "tutorial_20"],
    ["Diabetes and Mental Health", "Kevin Mitchell", "2024-09-30", "Diabetes can take a toll on mental health. This tutorial explores the connection between diabetes and mental health, and offers tips for managing stress, anxiety, and depression while living with diabetes.", "tutorial_21"],
    ["The Role of Vitamins and Supplements in Diabetes Management", "Laura Allen", "2024-10-20", "Vitamins and supplements can support diabetes management. This tutorial discusses the role of various vitamins and supplements, their benefits, and how to incorporate them into your diabetes care plan safely.", "tutorial_22"],
    ["Creating a Diabetes-Friendly Meal Plan", "William Turner", "2024-11-10", "Meal planning is essential for managing diabetes. This tutorial provides guidance on creating a balanced meal plan that helps maintain stable blood sugar levels, including tips for meal prep, grocery shopping, and recipe ideas.", "tutorial_23"]
  ]
}
